# FamilySizeTableColumn Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableColumn Class
Members See Also
---
Contains column information for a FamilySizeTable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class FamilySizeTableColumn : IDisposable
```

Visual Basic
---
```text
Public Class FamilySizeTableColumn _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FamilySizeTableColumn : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FamilySizeTableColumn
# See Also
FamilySizeTableColumn Members
Autodesk.Revit.DB Namespace